Repository: ayazahmad4296294/KhidmatGaar
Catalog: lib/l10n/app_*.arb
Languages: ur

# appTitle
source: Khidmat
ur: خدمت

source: Home
ur: ہوم

source: My Packages
ur: میرے پیکجز

source: Loyalty Points
ur: وفاداری پوائنٹس

source: Referral
ur: ریفرل

source: My Conversations
ur: میری گفتگو

source: About Us
ur: ہمارے بارے میں

source: Terms and Conditions
ur: شرائط و ضوابط

source: Privacy Policy
ur: پرائیویسی پالیسی

source: Logout
ur: لاگ آؤٹ

source: Switch to Worker Mode
ur: ورکر موڈ پر جائیں

source: Language
ur: زبان

source: English
ur: انگریزی

source: Urdu
ur: اردو

source: Confirm Logout
ur: لاگ آؤٹ کی تصدیق کریں

# areYouSureLogout
source: Are you sure you want to logout?
ur: کیا آپ واقعی لاگ آؤٹ کرنا چاہتے ہیں؟

source: Cancel
ur: منسوخ کریں

source: Error fetching user data
ur: صارف کا ڈیٹا حاصل کرنے میں خرابی

source: User data not found
ur: صارف کا ڈیٹا نہیں ملا

source: No Name
ur: نام نہیں ہے

source: No Email
ur: ای میل نہیں ہے

# pleaseEnterValidPassword
source: Please enter a valid password
ur: براہ کرم درست پاس ورڈ درج کریں

source: Enter Admin Password
ur: ایڈمن پاس ورڈ درج کریں

source: Password
ur: پاس ورڈ

source: Submit
ur: جمع کریں

source: OK
ur: ٹھیک ہے

source: Yes
ur: ہاں

source: No
ur: نہیں

source: Confirm
ur: تصدیق کریں

source: Save
ur: محفوظ کریں

source: Edit Name
ur: نام میں ترمیم کریں

source: Edit Phone Number
ur: فون نمبر میں ترمیم کریں

source: Full Name
ur: پورا نام

source: Phone Number
ur: فون نمبر

source: Cancel Booking
ur: بکنگ منسوخ کریں

# areYouSureCancelBooking
source: Are you sure you want to cancel this booking? This action cannot be undone.
ur: کیا آپ واقعی اس بکنگ کو منسوخ کرنا چاہتے ہیں؟ اس عمل کو واپس نہیں کیا جا سکتا۔

source: Booking cancelled successfully
ur: بکنگ کامیابی سے منسوخ ہو گئی

# errorCancellingBooking
source: Error cancelling booking: {error}
ur: بکنگ منسوخ کرنے میں خرابی: {error}

source: Yes, Cancel
ur: ہاں، منسوخ کریں

# noCancel
source: No
ur: نہیں

source: Apply Loyalty Points
ur: وفاداری پوائنٹس لگائیں

# availablePoints
source: Available Points: {points}
ur: دستیاب پوائنٹس: {points}

# bookingTotal
source: Booking Total: PKR {price}
ur: کل بکنگ: PKR {price}

source: Points to Redeem
ur: ریڈیم کرنے کے پوائنٹس

# enterPointsHint
source: Enter points (500 minimum)
ur: پوائنٹس درج کریں (کم از کم 500)

# pleaseEnterPoints
source: Please enter points to redeem
ur: براہ کرم ریڈیم کرنے کے پوائنٹس درج کریں

# pleaseEnterValidNumber
source: Please enter a valid number
ur: براہ کرم درست نمبر درج کریں

# minimumPointsRequired
source: Minimum 500 points required
ur: کم از کم 500 پوائنٹس درکار ہیں

# notEnoughPoints
source: You don't have enough points
ur: آپ کے پاس کافی پوائنٹس نہیں ہیں

# pointsMustBeMultiple
source: Points must be in multiples of 500
ur: پوائنٹس 500 کے مضاعف میں ہونے چاہئیں

source: Review submitted successfully
ur: جائزہ کامیابی سے جمع ہو گیا

source: Write a Review
ur: جائزہ لکھیں

source: Your Review
ur: آپ کا جائزہ

# errorSubmittingReview
source: Error submitting review: {error}
ur: جائزہ جمع کرنے میں خرابی: {error}

source: Send Promotional Notification
ur: پروموشنل نوٹیفکیشن بھیجیں

source: Notification Title
ur: نوٹیفکیشن عنوان

source: Notification Message
ur: نوٹیفکیشن پیغام

# pleaseEnterTitle
source: Please enter a title
ur: براہ کرم عنوان درج کریں

# pleaseEnterMessage
source: Please enter a message
ur: براہ کرم پیغام درج کریں

# errorSendingNotifications
source: Error sending notifications: {error}
ur: نوٹیفکیشن بھیجنے میں خرابی: {error}

source: Redeem Points
ur: پوائنٹس ریڈیم کریں

# pointsToRedeemLabel
source: Points to Redeem
ur: ریڈیم کرنے کے پوائنٹس

# pointsToRedeemHint
source: Enter points (500 minimum)
ur: پوائنٹس درج کریں (کم از کم 500)

source: Please enter points to redeem
ur: براہ کرم ریڈیم کرنے کے پوائنٹس درج کریں

source: Minimum 500 points required
ur: کم از کم 500 پوائنٹس درکار ہیں

# dontHaveEnoughPoints
source: You don't have enough points
ur: آپ کے پاس کافی پوائنٹس نہیں ہیں

source: No scheduled services
ur: کوئی شیڈول سروسز نہیں ہیں

source: Start Service
ur: سروس شروع کریں

source: Mark Complete
ur: مکمل کریں

source: Accept
ur: قبول کریں

source: Negotiate
ur: مذاکرات کریں

source: Confirm Acceptance
ur: قبولیت کی تصدیق کریں

source: Service
ur: سروس

source: Date
ur: تاریخ

source: Price
ur: قیمت

source: Pending
ur: زیر التواء

source: Completed
ur: مکمل

source: All
ur: تمام

source: Filter Bookings
ur: بکنگز کو فلٹر کریں

source: Something went wrong
ur: کچھ غلط ہو گیا

source: Status
ur: حالت

source: Scheduled
ur: شیڈول شدہ
